Revit 2027 API
FabricationPart.MaterialGauge Property
 The fabrication material gauge identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int MaterialGauge { get; }
Public ReadOnly Property MaterialGauge As Integer
	Get
public:
property int MaterialGauge {
	int get ();
}
member MaterialGauge : int with get
Property Value
Int32
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace